Revit 2027 API
InternalDefinition.SetGroupTypeId Method
 Sets the built-in parameter group to which the parameter defined by this definition belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetGroupTypeId(
	ForgeTypeId groupTypeId
)
Public Sub SetGroupTypeId (
	groupTypeId As ForgeTypeId
)
public:
void SetGroupTypeId(
	ForgeTypeId^ groupTypeId
)
member SetGroupTypeId :
        groupTypeId : ForgeTypeId -> unit
Parameters
groupTypeId ForgeTypeId
Identifier of the built-in parameter group.
Remarks
The parameter group can be changed, but only for parameters that are not built in. In other words: This method is only valid for parameter definitions for which GetParameterTypeId() returns a null identifier.
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace